Revit 2024 API
ParameterTypeId.RgbRParam Property
 "Red value for RGB color spec. (for Use with XAML Data Template example)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RgbRParam { get; }
Visual Basic
Public Shared ReadOnly Property RgbRParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RgbRParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace